Run for an existing user:
```
# module.ali_test_user.aws_iam_group.default[0] will be created
  + resource "aws_iam_group" "default" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "aliTestUser"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.ali_test_user.aws_iam_group_policy.default[0] will be created
  + resource "aws_iam_group_policy" "default" {
      + group  = "aliTestUser"
      + id     = (known after apply)
      + name   = "aliTestUser"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:UpdateFunctionCode",
                          + "lambda:ListVersionsByFunction",
                          + "lambda:PublishVersion",
                          + "lambda:UpdateAlias",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lambda:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.ali_test_user.aws_iam_user_group_membership.default will be created
  + resource "aws_iam_user_group_membership" "default" {
      + groups = [
          + "aliTestUser",
        ]
      + id     = (known after apply)
      + user   = "aliTestUser"
    }

  # module.ali_test_user.aws_iam_user_policy.default[0] will be destroyed
  - resource "aws_iam_user_policy" "default" {
      - id     = "aliTestUser:aliTestUser" -> null
      - name   = "aliTestUser" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:UpdateFunctionCode",
                          - "lambda:ListVersionsByFunction",
                          - "lambda:PublishVersion",
                          - "lambda:UpdateAlias",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - user   = "aliTestUser" -> null
    }

  # module.ali_test_user.aws_ssm_parameter.access_key_id must be replaced
-/+ resource "aws_ssm_parameter" "access_key_id" {
      ~ arn       = "arn:aws:ssm:eu-west-1:484733165122:parameter/alitestuseraccount/credentials/access_key_id" -> (known after apply)
      ~ data_type = "text" -> (known after apply)
      ~ id        = "/alitestuseraccount/credentials/access_key_id" -> (known after apply)
      ~ key_id    = "alias/aws/ssm" -> (known after apply)
      ~ name      = "/alitestuseraccount/credentials/access_key_id" -> "/alitestuser/credentials/access_key_id" # forces replacement
        tags      = {
            "name" = "testing"
        }
      ~ version   = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.ali_test_user.aws_ssm_parameter.secret_access_key must be replaced
-/+ resource "aws_ssm_parameter" "secret_access_key" {
      - allowed_pattern = "" -> null
      ~ arn             = "arn:aws:ssm:eu-west-1:484733165122:parameter/alitestuseraccount/credentials/secret_access_key" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      - description     = "" -> null
      ~ id              = "/alitestuseraccount/credentials/secret_access_key" -> (known after apply)
      ~ key_id          = "alias/aws/ssm" -> (known after apply)
      ~ name            = "/alitestuseraccount/credentials/secret_access_key" -> "/alitestuser/credentials/secret_access_key" # forces replacement
        tags            = {
            "name" = "testing"
        }
      ~ version         = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }
```